app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" WHERE "movies"."rating" IN ('1', '2', '3', '4', '5', '6', '7', '8', '9', '10')  ORDER BY title
---
    def index
      @m_ratings = Movie.list_ratings
      @sortby = params[:sortby] || session[:sortby]
      @final_ratings =  params[:ratings] || session[:ratings] || Hash[@m_ratings.map {|rating| [rating, rating]}]